{"content": "Нова спільна освітня програма ФІОТ та НН ІМЗ імені Є.О. Патона.\nВідкрито набір абітурієнтів (за бюджетною формою) на нову міждисциплінарну освітню програму підготовки бакалаврів: “Інженерія металевих матеріалів програмними засобами штучного інтелекту”, яка об’єднує дві спеціальності – F2 “Інженерія програмного забезпечення” та…\nНова спільна освітння програма ФІОТ та НН ММІ.\nВідкрито набір абітурієнтів (на бюджетну форму навчання) на нову міждисциплінарну освітню програму підготовки бакалаврів “Штучний інтелект в механічній інженерії”. Освітня програма спрямована на поєднання знань і навичок, які отримують здобувачі…\nАбітФест ФІОТ 26.04.25!\nНаціональний технічний університет України КПІ ім. Ігоря Сікорського щиро запрошує вступників та їх батьків на АбітФест Факультету Інформатики та Обчислювальної Техніки (ФІОТ) ОЧНО ФІОТ готує за спеціальностями: F2 Інженерія програмного…\nСтарт другого туру вибору дисциплін!\nСтарт другого туру вибору дисциплін студентами 1-4го курсів бакалаврату та 1-го курсу аспірантури!З 14:00 07 квітня починається другий тур вибору дисциплін.Алгоритм дій наступний.З 7 квітня до 12 квітня зайти та…\nЗВІТ декана ФІОТ про діяльність факультету у 2024 році\nОзнайомитись зі звітом декана ФІОТ за 2024 рік можна тут\nКонференція трудового колективу ФІОТ!\nКонференції трудового колективуфакультету інформатики та обчислювальної техніки25.03.2025 року 16:00, онлайн (зум).\nВибір дисциплін для студентів бакалаврів 3-го курсу на 4й курс!\nФІОТ запускає вибірковість дисциплін для студентів бакалаврів 3-го курсу на 4й курс .Вибір дисциплін стартує 19.03.2025 о 14:00. Алгоритм дій для вибору дисципліни:• Уважно ознайомитись з Ф-каталогом вибіркових дисциплін та…\nВибір дисциплін для студентів бакалаврів 2-го курсу на 3й курс!\nФІОТ запускає вибірковість дисциплін для студентів бакалаврів 2-го курсу на 3й курс .Вибір дисциплін стартує 18.03.2025 о 14:00. Алгоритм дій для вибору дисципліни:• Уважно ознайомитись з Ф-каталогом вибіркових дисциплін та…\nКаталог вибіркових дисциплін для PhD 2025!\nШановні аспіранти 2024 року вступу, до Вашої уваги представлено каталог вибіркових дисциплін. Дані дисципліни Ви будете обирати на другий курс аспірантури, потрібно обрати 3 дисципліни на 4-й семестр. Уважно ознайомтесь…\nВибір дисциплін для студентів бакалаврів 1-го курсу на 2й курс!\nФІОТ запускає вибірковість дисциплін для студентів бакалаврів 1-го курсу на 2й курс .Вибір дисциплін стартує 10.03.2025 о 9:00. Алгоритм дій для вибору дисципліни:• Уважно ознайомитись з Ф-каталогом вибіркових дисциплін та…", "metadata": {"source": "https://fiot.kpi.ua/", "md5": "d495a137bcf806b6be78246554be02c3"}}
{"content": "До складу факультету входять окремі функціональні підрозділи, у тому числі:\n– деканат,\n– профілюючі (випускаючі) кафедри,\n– навчально-методичний, навчально-організаційно-виховний, науковий відділи, бухгалтерія та ін.\nДеканат\nФахівець деканату: Хоменко Віра Петрівна 204-90-34\nМетодичний кабінет: Алієва Оксана Михайлівна 204-98-26\nПомічник декана з адміністративно-господарської роботи: Ігнатюк Сергій Ростиславович 204-94-11\nГоловний бухгалтер: Мировець Галина Анатоліївна 204-94-12\nКафедри факультету\nІнформаційних систем та технологій – ІСТ https://ist.kpi.ua/\nОбчислювальної технiки – ОТ http://comsys.kpi.ua\nІнформатики та програмної інженерії – ІПІ http://asu.kpi.ua", "metadata": {"source": "https://fiot.kpi.ua/?page_id=60", "md5": "9261aaf45282b19273f88be65cc585c8"}}
{"content": "Кафедра ІСТ здійснює підготовку бакалаврів, магістрів та докторів філософії за спеціальністю\nОсвітня програма «Інтегровані інформаційні системи»\nМетою освітньої програми «Інтегровані інформаційні системи» на кафедрі «Інформаційних систем та технологій» є підготовка фахівців, які глибоко розуміють загальний стан сучасних інформаційних систем та технологій здатних розробляти комплексні інженерні рішення по створенню компонентів інтегрованих інформаційних систем та здійснювати відповідну професійну діяльність у різних галузях людської діяльності, національної економіки та виробництва і реалізується через:\n• гармонійне і багатовимірне виховання майбутніх висококваліфікованих технічних фахівців, здатних комплексно й системно аналізувати проблеми інформаційних систем та технологій та суміжних галузей, усвідомлюючи природу оточуючих процесів і явищ, забезпечувати і провадити міжкультурну комунікацію;\n• формування високої адаптивності здобувачів вищої освіти в умовах трансформації ринку праці через взаємодію з роботодавцями та іншими стейкхолдерами.\nОсвітня програма «Інформаційні управляючі системи та технології»\nМетою освітньої програми «Інформаційні управляючі системи та технології» на кафедрі «Інформаційних систем та технологій» є фундаментальна та комплексна підготовка фахівців, здатних розробляти комплексні інженерні рішення зі створення, впровадження і супроводу інформаційних управляючих систем та технологій підтримки прийняття управлінських рішень в підприємництві, бізнесі, державному та регіональному управлінні, з урахуванням міжнародних стандартів в галузі інформаційних систем та технологій, з використанням інноваційних підходів, новітніх технологій та потужного математичного апарату, що забезпечує конкурентоспроможність на сучасному ринку праці випускникові даної освітньої програми.\nОсвітня програма «Інформаційне забезпечення робототехнічних систем»\nМетою освітньої програми «Інформаційне забезпечення робототехнічних систем» на кафедрі «Інформаційних систем та технологій» є підготовка фахівця, здатного вирішувати складні задачі і практичні проблеми у галузі інформаційних систем і технологій та здійснювати професійну діяльність з проектування, реалізації, розгортання, розвитку та адміністрування інформаційних систем в галузі робототехніки та інформаційного забезпечення робототехнічних систем.\nОсвітня програма «Інформаційні системи та технологі»\nМетою ОНП є підготовка професіоналів, які глибоко розуміють загальний стан сучасних інформаційних систем та технологій та пов’язаних з ними теоретичних принципів дослідницької, інноваційної та педагогічної діяльності, успішно здійснюють наукові дослідження, проектування, розробку, впровадження й ефективне застосування інформаційних систем та технологій (ІСТ) у різних галузях людської діяльності, інтернаціональної економіки та виробництва. Особливістю програми є формування компетентністного підходу з урахуванням міжнародного рівня розвитку спеціальності, тенденцій її оновлення, у тому числі з використанням закордонної практики бенчмаркентингу, як безперервного процесу детального дослідження передового досвіду, що сприяє швидкому вдосконаленню конкурентоспроможності.\nМета освітніх програм відповідає стратегії розвитку КПІ ім. Ігоря Сікорського на 2020-2025 роки щодо формування суспільства майбутнього на засадах концепції сталого розвитку.\nЦіллю освітніх програм є забезпечення розвитку інноваційної освіти з використанням проблемно-орієнтованих технологій на основі впровадження гнучких програм підготовки фахівців, розроблення нових навчальних курсів за пріоритетними напрямами науки і техніки в галузі інформаційних систем та технологій.\nОднією з провідних кафедр України, діяльність якої пов’язана з інформатизацією, є кафедра Інформаційних систем та технологій Факультету інформатики та обчислювальної техніки Національного технічного університету України “Київський політехнічний інститут імені Ігоря Сікорського”.\nОсобливістю підготовки наших випускників є глибоке вивчення найсучасніших високотехнологічних галузей науки і техніки: інформаційних технологій; комп’ютерної, мікропроцесорної техніки та електроніки; систем та мереж передачі даних і телекомунікацій; комп’ютеризованих систем управління. Наші студенти отримують грунтовні знання з дисциплін: програмування, об’єктно-орієнтоване програмування, технології розроблення програмного забезпечення, системне програмування, бази даних, операційні системи, Front-End- програмування, WEB-технології, технології .NET, інфраструктура інформаційних технологій, інтернет речей тощо).", "metadata": {"source": "https://ist.kpi.ua/", "md5": "37f5ba1d3aaae34c090e5200fc8c7036"}}
{"content": "АБІТУРІЄНТАМ\nАБІТУРІЄНТАМ\nСТУДЕНТАМ\nСТУДЕНТАМ\nМАГІСТРАМ\nМАГІСТРАМ\nОфіційний сайт Національного технічного університету України КПІ ім. Ігоря Сікорського\nПерейтиВідділ професійної орієнтації - Центр розвитку карʼєри КПІ ім. Ігоря Сікорського\nПерейтиНауково-технічна бібліотека Національного технічного університету України КПІ ім. Ігоря Сікорського\nПерейтиспеціальності\nЛабораторій\nДисциплін\nВипускників\nСтарший викладач\nПроректор з наукової роботи\nСтарший викладач\nДоктор філософії\nКандидат технічних наук\nБажаєш долучитися до навчання в колективі професіоналів?\nЦі показники відображають рівень підготовки студентів, успішність працевлаштування випускників та міжнародну інтеграцію кафедри.", "metadata": {"source": "https://comsys.kpi.ua/", "md5": "591fe7b5dd46416a34f1f7e94380d6e6"}}
